{"description": [{"id": "aaaaaa_aaaaaa:20", "comments": ["Element X Function:", "Closes or clears the current search input or overlay.", "  ", "After Hover:", "None", "  ", "After Click:", "Window Disappear"]}, {"id": "aaaaaa_aaaaaa:65", "comments": ["Element Futures Function:", "Filters or navigates to content related to futures trading.", "  ", "After Hover:", "The 'Futures' tab has a red border around it, signifying that it is being hovered over.", "  ", "After Click:", "The click on the 'Futures' tab resulted in a content switch, displaying a list of various futures contracts such as E-MINI NASDAQ-100 FUTURES, E-MINI S&P 500 FUTURES, and others."]}, {"id": "aaaaaa_aaaaaa:102", "comments": ["Element Forex Function:", "Filters or displays options related to foreign exchange trading.", "  ", "After Hover:", "The 'Forex' tab has a red border around it, indicating a hover effect.", "  ", "Click Popup Window:", "At the top of the popup window, there are tabs labeled Symbols, Ideas, Scripts, People, Sparks with the Symbols tab being active. Below the tabs, there are filter options: All, Stocks, Funds, Futures, Forex, Crypto, Indices, Bonds, Economy, Options with the Forex option highlighted. Underneath, there is a dropdown menu labeled All sources. The main section lists various forex currency pairs starting with EURUSD followed by other pairs such as GBPUSD, USDJPY, AUDUSD, USDCAD, USDCHF, NZDUSD. Each entry has a corresponding flag icon on the left side. For example, the first entry shows the European Union flag for EURUSD. Next to each currency pair abbreviation, there is a description of the currencies involved, such as EURO / UNITED STATES DOLLAR for EURUSD. On the far right of each entry, there is either a broker name or a featured tag. The first entry has a purple FEATURED tag with CMC Markets next to it. Other brokers listed include FXCM, OANDA, FOREX.com. Each entry also has an information icon on the far right."]}, {"id": "aaaaaa_aaaaaa:69", "comments": ["Element Crypto Function:", "Filters or navigates to cryptocurrency-related content.", "  ", "After Hover:", "A red border appears around the 'Crypto' tab when hovered over, indicating an active hover state.", "  ", "Click Popup Window:", "At the top of the popup window, there are five tabs labeled 'Symbols', 'Ideas', 'Scripts', 'People', and 'Sparks'. The 'Symbols' tab is currently active, indicated by its black color. Below the tabs, there are filter options for different categories: 'All', 'Stocks', 'Funds', 'Futures', 'Forex', 'Crypto', 'Indices', 'Bonds', 'Economy', and 'Options'. The 'Crypto' category is selected, highlighted in black. Underneath, there are three dropdown menus labeled 'All sources', 'All types', and 'All exchange types', each with a downward arrow indicating they can be expanded. The main content area lists various cryptocurrency trading pairs and indices. Each row contains an icon on the far left, followed by the symbol of the pair or index, a description, and additional details on the far right. For example, the first row shows a blue circular icon with a 'B' inside it, the symbol 'BTCUSDT', the description 'BITCOIN / TETHERUS', and on the far right, the text 'spot crypto Binance' along with a yellow circular icon. This pattern continues down the list with different symbols, descriptions, and exchanges or sources mentioned. Some rows have orange circular icons, others have blue ones, and one has a black circular icon. The exchanges mentioned include Binance, Bitstamp, Coinbase, CRYPTOCAP, INDEX, CAPITALCOM, and Bybit. There are also two rows marked with a TV icon, suggesting video content related to the listed items."]}, {"id": "aaaaaa_aaaaaa:94", "comments": ["Element All Function:", "Displays all available categories or options on the webpage.", "  ", "After Hover:", "The 'All' tab's text color changed to white and its background color changed to red when hovered.", "  ", "After Click:", "None"]}, {"id": "aaaaaa_aaaaaa:23", "comments": ["Element Clear Function:", "Clears the input field or resets the search query.", "  ", "After Hover:", "None", "  ", "After Click:", "None"]}, {"id": "aaaaaa_aaaaaa:31", "comments": ["Element Ideas Function:", "Navigates to a section containing community-generated trading ideas and strategies.", "  ", "After Hover:", "The 'Ideas' tab changes to have a red border when hovered over.", "  ", "Click Popup Window:", "The popup window displays the word 'Ideas' in a simple, sans-serif font. The text is horizontally aligned and there are no additional design elements, icons, buttons, input boxes, checkboxes, radio buttons, dropdown menus, or any other interactive components visible."]}, {"id": "aaaaaa_aaaaaa:56", "comments": ["Element Scripts Function:", "Displays or manages custom trading scripts or financial instrument lists.", "  ", "After Hover:", "The 'Scripts' tab is highlighted with a red border when hovered over.", "  ", "Click Popup Window:", "The image shows only the word 'Scripts' in a plain font against a white background. There are no other visible elements such as tabs, buttons, icons, input boxes, checkboxes, radio buttons, dropdown menus, or any other UI components typically found in a popup window."]}, {"id": "aaaaaa_aaaaaa:48", "comments": ["Element Symbols Function:", "Displays a list of financial symbols or instruments available for trading.", "  ", "After Hover:", "The 'Symbols' tab now has a bold underline, suggesting it is being hovered over by the cursor.", "  ", "After Click:", "The click on the 'Symbols' tab has been registered, indicated by the absence of the red box in the second image. No other content changes are visible."]}, {"id": "aaaaaa_aaaaaa:77", "comments": ["Element Options Function:", "Filters or displays options-related financial instruments.", "  ", "After Hover:", "A red border appears around the 'Options' tab when hovered over, indicating an active hover state.", "  ", "Click Popup Window:", "The popup window has a header with tabs labeled Symbols, Ideas, Scripts, People, Sparks. The Symbols tab is active. Below the header, there are filter buttons for All, Stocks, Funds, Futures, Forex, Crypto, Indices, Bonds, Economy, and Options. The Options button is highlighted. The main content area lists various options contracts. Each entry starts with a blue circular icon featuring a white upward arrow. Next to the icon is a string of characters representing the contract ID (e.g., AA250516C14.0). Following the ID is the text 'AA OPTIONS 16 MAY 2025 CALL' and a numerical value indicating the strike price. To the far right of each entry, the text 'OPRA' appears alongside a small American flag icon. The entries are ordered by increasing strike price from 14.0 to 22.5."]}, {"id": "aaaaaa_aaaaaa:85", "comments": ["Element Indices Function:", "Filters or displays financial market indices information.", "  ", "After Hover:", "A red border appears around the 'Indices' tab when hovered over.", "  ", "Click Popup Window:", "At the top of the popup window, there are tabs labeled Symbols, Ideas, Scripts, People, Sparks, with the Symbols tab currently active. Below the tabs, there are filter options for All, Stocks, Funds, Futures, Forex, Crypto, Indices, Bonds, Economy, Options, where Indices is highlighted. Underneath, it says 'All sources' with a dropdown arrow. The main content area lists financial indices: each row contains an icon on the far left, followed by the index symbol and name. For example, the first row has a red circle with '500' inside, next to 'SPX' and 'S&P 500'. On the far right of each row, there is text indicating the type of instrument ('index cfd'), the platform name (like 'SP', 'NSE', 'TVC'), and a small flag icon. The rows continue in this format listing different indices such as NIFTY 50 INDEX, U.S. DOLLAR CURRENCY INDEX, and others."]}, {"id": "aaaaaa_aaaaaa:73", "comments": ["Element Bonds Function:", "Filters or displays information related to bond financial instruments.", "  ", "After Hover:", "The 'Bonds' tab changes color to red when hovered over.", "  ", "Click Popup Window:", "The popup window has a header with tabs labeled Symbols, Ideas, Scripts, People, Sparks. Below the header are filter options for All, Stocks, Funds, Futures, Forex, Crypto, Indices, Bonds, Economy, Options with Bonds highlighted. There are dropdown menus for All countries and All types. The main section lists various bonds: US10Y with United States 10 Year Government Bonds Yield, US02Y with United States 2 Year Government Bonds Yield, US30Y with United States 30 Year Government Bonds Yield, US20Y with United States 20 Year Government Bonds Yield, US05Y with United States 5 Year Government Bonds Yield, JP10Y with Japan 10 Year LSEG Government Bonds Yield, DE10Y with Germany 10 Year Government Bonds Yield, US01Y with United States 1 Year Government Bonds Yield, GB10Y with United Kingdom 10 Year Government Bonds Yield, US03MY with United States 3 Month Government Bonds Yield, US10 with United States 10 Year Government Bonds, AU10Y with Australia 10 Year Government Bonds Yield, US03Y with United States 3 Year Government Bonds Yield. Each entry has a corresponding flag icon and two TVC icons."]}, {"id": "aaaaaa_aaaaaa:98", "comments": ["Element Economy Function:", "Filters or navigates to content related to economic data or news.", "  ", "After Hover:", "A red border appears around the 'Economy' tab when hovered over, indicating an active hover state.", "  ", "Click Popup Window:", "The popup window starts with a navigation bar at the top featuring tabs labeled Symbols, Ideas, Scripts, People, Sparks. The Economy tab is highlighted. Below the navigation bar are filter options for All countries, All sources, and All categories. The main content area lists various economic indicators: BAMLH0A0HYM2 with ICE BOFA US HIGH YIELD INDEX OPTION-ADJUSTED SPREAD and source ICE; FEDFUNDS with EFFECTIVE FEDERAL FUNDS RATE and source Federal Reserve; USINTR with UNITED STATES INTEREST RATE and source Federal Reserve; USM2 with UNITED STATES MONEY SUPPLY M2 and source Federal Reserve; WALCL with BALANCE SHEET: ASSETS: TOTAL ASSETS: TOTAL ASSETS (LESS ELIMINATIONS) and source Federal Reserve; USIRYY with UNITED STATES INFLATION RATE YOY and source BLS; USBCOI with UNITED STATES ISM PURCHASING MANAGERS INDEX (PMI) and source ISM; M2SL with M2 MONEY STOCK and source Federal Reserve; UNRATE with UNEMPLOYMENT RATE and source BLS; SP500 with S&P 500 and source S&P DJI; T10Y2Y with 10-YEAR TREASURY CONSTANT MATURITY MINUS 2-YEAR TREASURY CONSTANT MATURITY and source FRB St. Louis; T10YIE with 10-YEAR BREAK-EVEN INFLATION RATE and source FRB St. Louis; RRPONTSYD with OVERNIGHT REVERSE REPURCHASE AGREEMENTS: TREASURY SECURITIES and source FRB New York. Each entry has a corresponding flag icon and an information icon."]}, {"id": "aaaaaa_aaaaaa:81", "comments": ["Element Funds Function:", "Filters or displays financial instruments categorized as funds.", "  ", "After Hover:", "A red border appears around the 'Funds' tab when hovered over, indicating an active hover state.", "  ", "Click Popup Window:", "At the top of the popup window, there are tabs labeled Symbols, Ideas, Scripts, People, and Sparks, with Symbols being the active tab. Below the tabs, there are filter options for All, Stocks, Funds, Futures, Forex, Crypto, Indices, Bonds, Economy, and Options, with Funds currently selected. There are also dropdown menus for selecting All countries and All types. The main section lists various funds, each entry consisting of an icon on the left, followed by the ticker symbol, fund name, and exchange information on the right. The entries include SPY for SPDR S&P 500 ETF TRUST listed on NYSE Arca, QQQ for INVESCO QQQ TRUST, SERIES 1 on NASDAQ, IWM for iSHARES RUSSELL 2000 ETF on NYSE Arca, TQQQ for PROSHARES ULTRAPRO QQQ on NASDAQ, SOXL for DIREXION DAILY SEMICONDUCTOR BULL 3X SHARES on NYSE Arca, GLD for SPDR GOLD TRUST on NYSE Arca, TLT for iSHARES 20+ YEAR TREASURY BOND ETF on NASDAQ, IBIT for iSHARES BITCOIN TRUST on NASDAQ, TSLL for DIREXION DAILY TSLA BULL 2X SHARES on NASDAQ, VOO for VANGUARD S&P 500 ETF on NYSE Arca, DIA for SPDR DOW JONES INDUSTRIAL AVERAGE ETF on NYSE Arca, SMH for VANECK SEMICONDUCTOR ETF on NASDAQ, and SQQQ for PROSHARES ULTRAPRO SHORT QQQ on NASDAQ."]}, {"id": "7e5b61_7db208:77", "comments": ["Element Transparent_Fx_Academy Function:", "Navigates to the user profile of Transparent_Fx_Academy", "  ", "After Hover:", "The background color of the 'Transparent_Fx_Academy' row has changed to light gray when hovered.", "  ", "After Click:", "Jump to URL: https://www.tradingview.com/u/Transparen..."]}, {"id": "f33e12_a23ff7:1274", "comments": ["Element All sectors Function:", "Allows users to filter or view data across all available sectors.", "  ", "After Hover:", "A red box appears around the 'All sectors' dropdown when hovered over, indicating selection or focus.", "  ", "Click Popup Window:", "The popup window begins with the label 'All sectors' at the top. Below this header, there is a list of sectors presented in a vertical arrangement. The sectors listed are: Commercial Services, Communications, Consumer Durables, Consumer Non-Durables, Consumer Services, Distribution Services, Electronic Technology, Energy Minerals, Finance, Government sector, Health Services, Health Technology, Industrial Services, Miscellaneous, Non-Energy Minerals, Process Industries, Producer Manufacturing, Retail Trade, Technology Services, Transportation, Utilities. Each sector name appears to be a selectable item, likely functioning as a tab or button within the popup interface."]}, {"id": "f33e12_a23ff7:1264", "comments": ["Element All countries Function:", "Filters or selects country-specific data on the webpage.", "  ", "After Hover:", "A red border appears around the 'All countries' dropdown when hovered over.", "  ", "Click Popup Window:", "The popup window has a black header with white text reading 'All countries' and a globe icon on the left. Below the header, the window is divided into sections for different regions. The first section is labeled 'NORTH AMERICA' in uppercase letters. Under this label, there are two entries: 'USA' with an American flag icon and a list of financial market abbreviations NASDAQ, NYSE, Arca, OTC, DJ, SP, CBOE, MSTAR, FINRA BTDS, OPR..., and 'Canada' with a Canadian flag icon and the financial market abbreviations CSE, Cboe Canada, TSX, TSXV, TMX. The next section is labeled 'EUROPE'. This section contains multiple entries, each with a corresponding flag icon and financial market abbreviation. The entries are listed in two columns. In the left column, the entries are 'Austria' with a flag icon and WB, 'Belgium' with a flag icon and EURONEXTBRU, 'Cyprus' with a flag icon and CSE, 'Czech Republic' with a flag icon and PSE, 'Denmark' with a flag icon and CSE, 'Estonia' with a flag icon and TALSE, 'European Union' with a flag icon and EUREX, CBOE EU, ICEINDEX, ICEEUR, ICEEUR, Euronext, OMX, and 'Finland' with a flag icon and HEX. In the right column, the entries are 'Lithuania' with a flag icon and VSE, 'Luxembourg' with a flag icon and LUXE, 'Netherlands' with a flag icon and EURONEXTAMS, 'Norway' with a flag icon and EURONEXTOSE, 'Poland' with a flag icon and GPW, GPW - NewConnect, 'Portugal' with a flag icon and EURONEXTLIS, 'Romania' with a flag icon and BVB, and 'Russia' with a flag icon and RUS."]}, {"id": "fbcbe9_2df9c6:175", "comments": ["Element See overview Function:", "Navigates to a detailed view of the stock information", "  ", "After Hover:", "The 'See overview' button for the STR stock has a red border, indicating it is being hovered over.", "  ", "After Click:", "Jump to URL: https://www.tradingview.com/symbols/NASD..."]}, {"id": "fbcbe9_2df9c6:1272", "comments": ["Element Preferred stock Function:", "Filters or selects stocks that are categorized as preferred.", "  ", "After Hover:", "The hover effect includes a change in the background color of the third row to gray and the appearance of two interactive buttons 'Launch chart' and 'See overview' next to the hovered item.", "  ", "Click Popup Window:", "The interface shows a navigation bar at the top with tabs labeled Symbols, Ideas, Scripts, People, Sparks. The Symbols tab is active. Below this, there are filter options for All, Stocks, Funds, Futures, Forex, Crypto, Indices, Bonds, Economy, Options. The Stocks filter is selected. There are additional dropdown filters for All countries, All types, and All sectors. The main content area lists various stocks: each row contains a circular icon on the far left, followed by the ticker symbol, the company name, the word 'stock', the exchange listing NASDAQ, and a US flag. The companies listed are TESLA, INC., NVIDIA CORPORATION, APPLE INC., PALANTIR TECHNOLOGIES INC., AMAZON.COM, INC., META PLATFORMS, INC., MICROSOFT CORPORATION, MICROSTRATEGY INCORPORATED, ADVANCED MICRO DEVICES, INC., COINBASE GLOBAL, INC., ALPHABET INC. twice, NETFLIX, INC., and another entry partially visible."]}, {"id": "fbcbe9_2df9c6:171", "comments": ["Element Launch chart Function:", "Initiates a detailed chart view of the selected stock's performance.", "  ", "After Hover:", "The 'Launch chart' button for the STR stock has been highlighted, suggesting that it is being hovered over by the cursor.", "  ", "After Click:", "Jump to URL: https://www.tradingview.com/chart/?symbo..."]}], "edges": [{"id": "aaaaaa_aaaaaa:35_7e5b61_7db208:0", "start": "aaaaaa_aaaaaa:35", "end": "7e5b61_7db208:0", "content": ["点击", "Navigates to the user profiles or community interaction section"]}, {"id": "aaaaaa_aaaaaa:61_f33e12_a23ff7:0", "start": "aaaaaa_aaaaaa:61", "end": "f33e12_a23ff7:0", "content": ["点击", "Filters or displays stock-related information within the application."]}, {"id": "f33e12_a23ff7:1269_2171ae_ab1773:0", "start": "f33e12_a23ff7:1269", "end": "2171ae_ab1773:0", "content": ["点击", "Filter content by different types"]}, {"id": "2171ae_ab1773:10_fbcbe9_2df9c6:0", "start": "2171ae_ab1773:10", "end": "fbcbe9_2df9c6:0", "content": ["点击", "Displays all available stock types"]}]}